-- №1
{-  а)должен начинаться с нечетной цифры;  -}
sooFun_1a [] = True
sooFun_1a [x] = odd(head)

{- б) содержать не менее трех строчных букв; -}
sooFun_1b [] = True
sooFun_1b [_] = True
sooFun_1b (x:y:z:xs)
			| elem x['a'..'z'] = True
			| otherwise = sooFun_1b xs

{- в) не содержать более одного символа, не являющегося ни цифрой и ни буквой. -}
sooFun_1v [] = True
sooFun_1v [x] = elem x";,.!?-"
sooFun_1v [x:y:xs] = ((elem x"aoeiu")||(notElem y "aoeiu"))&&sooFun_1a(y:xs)

{- Пример из методички -}
{- а) не должен содержать двух подряд идущих гласных букв -}
foo2_1a [] = True
foo2_1a [_] = True
foo2_1a [x:y:xs] = ((notElem x"aoeiu")||(notElem y "aoeiu"))&&foo2_1a(y:xs)

{- б)  должен содержать хотя бы один знак пунктуации -}
foo2_1b [x] = elem x";,.!?-"
foo2_1b (x:xs)
			| elem x";,.!?-" = True
			| otherwise = foo2_1b xs

{- в) все входящие символы – цифры должны быть кратны трем  -}
foo2_1v [] = True
foo2_1v (x:xs)
			| isDigit x = ((digitToInt x)`mod` 3)==0
			| otherwise = foo2_1v xs

main x=(foo2_1a x)&&(foo2_1b x)&&(foo2_1v x)

{- №2
	Зашифруйте текст данного задания с помощью шифра Цезаря с ключом, соответствующим 
	номеру варианта. Напишите функцию для расшифровки (можно одну функцию с дополнительным 
	аргументом, задающим режим шифровки или расшифровки).
-}

{- №3
	MMXV + 100001_(2)
-}

{- №4
	D = A / (B a A)
-}

{- №5
	По введенной дате в формате «dd.mm» определяет знак гороскопа(зодиакального). 
	Выводит соответствующие сообщения об ошибках в данных.
-}