{- №1
В задании описаны правила составления некоторого пароля. Написать функцию, проверяющую 
удовлетворяет ли заданная строка данным правилам. 
	а)должен начинаться с нечетной цифры;
-}
oddDigits1 x
 | x <= 0                      	= error "blearg"
 | x`mod`2 /= 0  				= True
 | otherwise                   	= False

-- б) содержать не менее трех строчных букв;
oddDigits2 x

-- в) не содержать более одного символа, не являющегося ни цифрой и ни буквой.
oddDigits3 x

{- №2
	Зашифруйте текст данного задания с помощью шифра Цезаря с ключом, соответствующим 
	номеру варианта. Напишите функцию для расшифровки (можно одну функцию с дополнительным 
	аргументом, задающим режим шифровки или расшифровки).
-}

{- №3
Написать функцию, вычисляющую значение выражения и выводящую ответ в десятичном 
представлении, функция должна иметь не более двух аргументов строкового(и только строкового!) 
типа.*Усложненный вариант – единственный аргумент – строка, непосредственно записанная в 
задании варианта.
	MMXV + 100001_(2)
-}

{- №4
Дано универсальное множество U={1,2,…,10} и некоторые его подмножества A,B,C. 
Найти множество D, заданное в варианте. (Реализовать множества списками). 
	D = A / (B a A)
-}

{- №5
Используя функции show, read, error, undefined напишите функцию, выполняющую 
указанные действия.
	По введенной дате в формате «dd.mm» определяет знак гороскопа(зодиакального). 
	Выводит соответствующие сообщения об ошибках в данных.
-}