{- №1
    (7.03^(1-sqrt 4.92))/(3*4.92-tg(7.03))
	x = 7.03, y = 4.92;
	(x**(1-sqrt y))/(3*y-tan(x))
-}
re1 x y = x**(1-sqrt y)/(3*y-tan x)
{- №2
    «Если разница между максимальным и минимальным элементами списка [1,2,3,4,5] нечетна, 
	то третий элемент этого списка не равен минимальному».
-}
re2 l = odd (maximum l - minimum l) == (l !! 3 /= minimum l)

{- №4
	snd (3,5) : init [1,2,3,4,5] == [5,1,2,3,4]
-}

{- №5
	Заменяет в заданном списке-строке все вхождения 
	заданного символа на другой заданный символ.
-}

{- №6
	??
-}